{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "3db0c63a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Requirement already satisfied: neo4j in c:\\users\\user\\appdata\\local\\programs\\python\\python310\\lib\\site-packages (6.1.0)Note: you may need to restart the kernel to use updated packages.\n",
      "\n",
      "Requirement already satisfied: pytz in c:\\users\\user\\appdata\\roaming\\python\\python310\\site-packages (from neo4j) (2025.2)\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "\n",
      "[notice] A new release of pip is available: 25.3 -> 26.0.1\n",
      "[notice] To update, run: python.exe -m pip install --upgrade pip\n"
     ]
    }
   ],
   "source": [
    "%pip install neo4j"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "0d5e830c",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "✅ Escenario logístico cargado con éxito.\n"
     ]
    }
   ],
   "source": [
    "from neo4j import GraphDatabase\n",
    "\n",
    "# Configuración de conexión (Asegúrate de que coincida con tu YAML)\n",
    "uri = \"bolt://localhost:7687\"\n",
    "user = \"neo4j\"\n",
    "password = \"grafo123\" \n",
    "\n",
    "driver = GraphDatabase.driver(uri, auth=(user, password))\n",
    "\n",
    "def ejecutar_carga_completa():\n",
    "    with driver.session() as session:\n",
    "        # 1. Limpieza total para un escenario limpio\n",
    "        session.run(\"MATCH (n) DETACH DELETE n\")\n",
    "        \n",
    "        # 2. Creación de nodos y rutas (Niveles: Almacén -> Intersección -> Punto Entrega)\n",
    "        # Se incluyen variaciones de tráfico y capacidad para los desafíos técnicos\n",
    "        query = \"\"\"\n",
    "        CREATE (a:Almacen {id: 'ALM_A', nombre: 'Centro Distribución Norte', x: 0, y: 10})\n",
    "        CREATE (i1:Interseccion {id: 'INT_1', nombre: 'Cruce Av. Bolívar', x: 5, y: 5})\n",
    "        CREATE (i2:Interseccion {id: 'INT_2', nombre: 'Redoma Chilemex', x: 10, y: 5})\n",
    "        CREATE (p:PuntoEntrega {id: 'ENT_B', nombre: 'Supermercado Central', x: 15, y: 0})\n",
    "        \n",
    "        // Ruta A: Directa pero con tráfico pesado\n",
    "        CREATE (a)-[:CONECTA_A {distancia: 12.0, tiempo_estimado: 20, estado_trafico: 0.9, capacidad_max_ton: 30.0}]->(p)\n",
    "        \n",
    "        // Ruta B: Vía Intersecciones (Más larga pero fluida)\n",
    "        CREATE (a)-[:CONECTA_A {distancia: 6.0, tiempo_estimado: 8, estado_trafico: 0.2, capacidad_max_ton: 25.0}]->(i1)\n",
    "        CREATE (i1)-[:CONECTA_A {distancia: 5.5, tiempo_estimado: 7, estado_trafico: 0.3, capacidad_max_ton: 15.0}]->(i2)\n",
    "        CREATE (i2)-[:CONECTA_A {distancia: 4.0, tiempo_estimado: 5, estado_trafico: 0.2, capacidad_max_ton: 10.0}]->(p)\n",
    "        \"\"\"\n",
    "        session.run(query)\n",
    "        print(\"✅ Escenario logístico cargado con éxito.\")\n",
    "\n",
    "ejecutar_carga_completa()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "id": "1a525c3f",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N42', status_description=\"The query used a deprecated field from a procedure. ('schema' returned by 'gds.graph.drop' is deprecated.)\", position=<SummaryInputPosition line=1, column=1, offset=0>, raw_classification='DEPRECATION', classification=<NotificationClassification.DEPRECATION: 'DEPRECATION'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/', '_classification': 'DEPRECATION', '_severity': 'WARNING', '_position': {'column': 1, 'offset': 0, 'line': 1}}> for query: \"CALL gds.graph.drop('grafo_logistica', false)\"\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "✅ Grafo proyectado en memoria exitosamente.\n"
     ]
    }
   ],
   "source": [
    "def proyectar_grafo():\n",
    "    with driver.session() as session:\n",
    "        # Borrar proyección si ya existe para evitar errores\n",
    "        session.run(\"CALL gds.graph.drop('grafo_logistica', false)\")\n",
    "        \n",
    "        # Crear la proyección con las propiedades necesarias para Dijkstra y A*\n",
    "        query = \"\"\"\n",
    "        CALL gds.graph.project(\n",
    "            'grafo_logistica',\n",
    "            ['Almacen', 'Interseccion', 'PuntoEntrega'],\n",
    "            {\n",
    "            CONECTA_A: {\n",
    "                orientation: 'NATURAL',\n",
    "                properties: ['distancia', 'tiempo_estimado', 'estado_trafico', 'capacidad_max_ton']\n",
    "            }\n",
    "            },\n",
    "            {\n",
    "            nodeProperties: ['x', 'y'] // Necesario para la heurística de A*\n",
    "            }\n",
    "        )\n",
    "        \"\"\"\n",
    "        result = session.run(query)\n",
    "        print(\"✅ Grafo proyectado en memoria exitosamente.\")\n",
    "\n",
    "proyectar_grafo()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "cddca05d",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N42', status_description=\"The query used a deprecated field from a procedure. ('schema' returned by 'gds.graph.drop' is deprecated.)\", position=<SummaryInputPosition line=1, column=1, offset=0>, raw_classification='DEPRECATION', classification=<NotificationClassification.DEPRECATION: 'DEPRECATION'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/', '_classification': 'DEPRECATION', '_severity': 'WARNING', '_position': {'column': 1, 'offset': 0, 'line': 1}}> for query: \"CALL gds.graph.drop('grafo_logistica', false)\"\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "✅ Grafo proyectado con éxito usando mapeo explícito.\n"
     ]
    }
   ],
   "source": [
    "def forzar_proyeccion():\n",
    "    with driver.session() as session:\n",
    "        # Paso A: Eliminar proyecciones viejas\n",
    "        session.run(\"CALL gds.graph.drop('grafo_logistica', false)\")\n",
    "        \n",
    "        # Paso B: Proyección con mapeo detallado de propiedades (Requisito para GDS 2.6.9)\n",
    "        query = \"\"\"\n",
    "        CALL gds.graph.project(\n",
    "            'grafo_logistica',\n",
    "            {\n",
    "                Almacen: { label: 'Almacen', properties: ['x', 'y'] },\n",
    "                Interseccion: { label: 'Interseccion', properties: ['x', 'y'] },\n",
    "                PuntoEntrega: { label: 'PuntoEntrega', properties: ['x', 'y'] }\n",
    "            },\n",
    "            {\n",
    "                CONECTA_A: {\n",
    "                    type: 'CONECTA_A',\n",
    "                    orientation: 'NATURAL',\n",
    "                    properties: {\n",
    "                        distancia: { property: 'distancia' },\n",
    "                        tiempo_estimado: { property: 'tiempo_estimado' },\n",
    "                        estado_trafico: { property: 'estado_trafico' }\n",
    "                    }\n",
    "                }\n",
    "            }\n",
    "        )\n",
    "        \"\"\"\n",
    "        session.run(query)\n",
    "        print(\"✅ Grafo proyectado con éxito usando mapeo explícito.\")\n",
    "\n",
    "forzar_proyeccion()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "id": "ab012555",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "--- 📊 RESULTADOS DEL OPTIMIZADOR ---\n",
      "📏 Ruta Dijkstra (Física): 12.0 km\n",
      "⏱️ Ruta A* (Inteligente): 20.0 min\n"
     ]
    }
   ],
   "source": [
    "#Comparación entre ruta más corta (física) y la más inteligente (tráfico)\n",
    "def ejecutar_comparativa():\n",
    "    with driver.session() as session:\n",
    "        query = \"\"\"\n",
    "        MATCH (startNode:Almacen {id: 'ALM_A'}), (endNode:PuntoEntrega {id: 'ENT_B'})\n",
    "        \n",
    "        // Algoritmo Dijkstra: Basado en distancia (Criterio Mínimo)\n",
    "        CALL gds.shortestPath.dijkstra.stream('grafo_logistica', {\n",
    "            sourceNode: startNode,\n",
    "            targetNode: endNode,\n",
    "            relationshipWeightProperty: 'distancia'\n",
    "        })\n",
    "        YIELD totalCost AS km\n",
    "        \n",
    "        // Algoritmo A*: Basado en tiempo/tráfico (Desafío Técnico #1)\n",
    "        CALL gds.shortestPath.astar.stream('grafo_logistica', {\n",
    "            sourceNode: startNode,\n",
    "            targetNode: endNode,\n",
    "            latitudeProperty: 'y',\n",
    "            longitudeProperty: 'x',\n",
    "            relationshipWeightProperty: 'tiempo_estimado'\n",
    "        })\n",
    "        YIELD totalCost AS minutos\n",
    "        \n",
    "        RETURN km, minutos\n",
    "        \"\"\"\n",
    "        result = session.run(query)\n",
    "        res = result.single()\n",
    "        if res:\n",
    "            print(f\"--- 📊 RESULTADOS DEL OPTIMIZADOR ---\")\n",
    "            print(f\"📏 Ruta Dijkstra (Física): {res['km']} km\")\n",
    "            print(f\"⏱️ Ruta A* (Inteligente): {res['minutos']} min\")\n",
    "\n",
    "ejecutar_comparativa()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "02c9fe08",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "--- 🚦 Tramos con Tráfico Crítico (> 0.7) ---\n",
      "Alerta en tramo CONECTA_A: Nivel 0.9\n"
     ]
    }
   ],
   "source": [
    "#Consulta 1: Análisis de Riesgo de Tráfico\n",
    "query1 = \"\"\"\n",
    "MATCH (a)-[r:CONECTA_A]->(b)\n",
    "WITH r, r.estado_trafico AS trafico \n",
    "WHERE trafico > 0.7\n",
    "RETURN type(r) as Relacion, trafico AS Nivel_Alerta\n",
    "\"\"\"\n",
    "with driver.session() as session:\n",
    "    result = session.run(query1)\n",
    "    print(\"--- 🚦 Tramos con Tráfico Crítico (> 0.7) ---\")\n",
    "    for record in result:\n",
    "        print(f\"Alerta en tramo {record['Relacion']}: Nivel {record['Nivel_Alerta']}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "14c0418f",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "--- 📋 Desglose de Propiedades Dinámicas ---\n",
      "Propiedad: distancia | Valor: 12.0\n",
      "Propiedad: distancia | Valor: 6.0\n",
      "Propiedad: tiempo_estimado | Valor: 20\n",
      "Propiedad: tiempo_estimado | Valor: 8\n",
      "Propiedad: estado_trafico | Valor: 0.9\n",
      "Propiedad: estado_trafico | Valor: 0.2\n"
     ]
    }
   ],
   "source": [
    "# Consulta 2: Desglose de Propiedades\n",
    "query2 = \"\"\"\n",
    "UNWIND ['distancia', 'tiempo_estimado', 'estado_trafico'] AS propiedad\n",
    "MATCH (n:Almacen)-[r:CONECTA_A]->()\n",
    "RETURN propiedad, r[propiedad] AS Valor\n",
    "\"\"\"\n",
    "with driver.session() as session:\n",
    "    result = session.run(query2)\n",
    "    print(\"--- 📋 Desglose de Propiedades Dinámicas ---\")\n",
    "    for record in result:\n",
    "        print(f\"Propiedad: {record['propiedad']} | Valor: {record['Valor']}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "8e202f2a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "--- 🚚 Rutas Disponibles para Carga Pesada (>= 15 ton) ---\n",
      "Ruta: ['Centro Distribución Norte', 'Supermercado Central'] | Saltos: 1\n"
     ]
    }
   ],
   "source": [
    "# Consulta 3: Reporte de Capacidad de Carga\n",
    "query3 = \"\"\"\n",
    "MATCH path = (a:Almacen)-[:CONECTA_A*1..3]->(p:PuntoEntrega)\n",
    "WHERE ALL(r IN relationships(path) WHERE r.capacidad_max_ton >= 15)\n",
    "RETURN [n in nodes(path) | n.nombre] as Ruta, length(path) as Saltos\n",
    "\"\"\"\n",
    "with driver.session() as session:\n",
    "    result = session.run(query3)\n",
    "    print(\"--- 🚚 Rutas Disponibles para Carga Pesada (>= 15 ton) ---\")\n",
    "    for record in result:\n",
    "        print(f\"Ruta: {record['Ruta']} | Saltos: {record['Saltos']}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "7826c738",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "--- 💰 Análisis de Costos por Tramo (Distancia x Tráfico) ---\n",
      "De Centro Distribución Norte a Supermercado Central: $22.80\n",
      "De Centro Distribución Norte a Cruce Av. Bolívar: $7.20\n",
      "De Cruce Av. Bolívar a Redoma Chilemex: $7.15\n",
      "De Redoma Chilemex a Supermercado Central: $4.80\n"
     ]
    }
   ],
   "source": [
    "# Consulta 4: Cálculo de Costo de Ruta Personalizado\n",
    "query4 = \"\"\"\n",
    "MATCH (a)-[r:CONECTA_A]->(b)\n",
    "WITH r, (r.distancia * (1 + r.estado_trafico)) AS costo_calculado\n",
    "RETURN startNode(r).nombre AS Origen, endNode(r).nombre AS Destino, costo_calculado\n",
    "\"\"\"\n",
    "with driver.session() as session:\n",
    "    result = session.run(query4)\n",
    "    print(\"--- 💰 Análisis de Costos por Tramo (Distancia x Tráfico) ---\")\n",
    "    for record in result:\n",
    "        print(f\"De {record['Origen']} a {record['Destino']}: ${record['costo_calculado']:.2f}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "f4ede62f",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "--- 🛠️ Estado de la Proyección GDS en Memoria ---\n",
      "Grafo: grafo_logistica | Nodos: 4 | Relaciones: 4\n"
     ]
    }
   ],
   "source": [
    "# Consulta 5: Auditoría de la Proyección\n",
    "query5 = \"\"\"\n",
    "CALL gds.graph.list() \n",
    "YIELD graphName, nodeCount, relationshipCount\n",
    "RETURN graphName, nodeCount, relationshipCount\n",
    "\"\"\"\n",
    "with driver.session() as session:\n",
    "    result = session.run(query5)\n",
    "    print(\"--- 🛠️ Estado de la Proyección GDS en Memoria ---\")\n",
    "    for record in result:\n",
    "        print(f\"Grafo: {record['graphName']} | Nodos: {record['nodeCount']} | Relaciones: {record['relationshipCount']}\")"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.11"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
